касса_Вегас/src/InformationRegisters/ЗапросыЕГАИС/ЗапросыЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапросыЕГАИС</name>
  <resources>
    <name>ТипЗапроса</name>
    <type>
      <types>CatalogRef.ВидыОбъектовЕГАИС</types>
    </type>
  </resources>
  <resources>
    <name>ДатаЗапроса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

касса_Вегас/src/Documents/ТоварноТранспортнаяНакладнаяЕГАИС/ТоварноТранспортнаяНакладнаяЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТоварноТранспортнаяНакладнаяЕГАИС</name>
  <attributes>
    <name>ДатаТТН</name>
    <comment>WBDate</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <comment>Identity</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторИсходящегоЗапросаАктаПодтверждения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодГрузоотправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <comment>WBNUMBER</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленоПодтверждение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленОтказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СправкаБТекстXML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТТНТекстXML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Квитанции</name>
    <attributes>
      <name>КвитанцияТекстXML</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

касса_Вегас/src/CommonModules/ИнтеграцияЕГАИСВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает параметры запроса документа, который нужно выгрузить в ЕГАИС.
//
// Параметры:
//  ТранспортныйМодуль  - Структура - модуль, для которого формируется текст документа,
//  ВидДокумента        - СправочникСсылка.ВидыОбъектовЕГАИС - вид документа,
//  Параметры           - Структура - параметры формирования документа.
//
// Возвращаемое значение:
//   Структура -  параметры запроса.
//
Функция ПараметрыЗапросаДокументаЕГАИС(ВидДокумента, Знач Параметры) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("АдресЗапроса", ВидДокумента.ПутьНаСервере);
	Результат.Вставить("ТекстЗапроса", ИнтеграцияЕГАИС.ТекстXMLВыгрузкиДокумента(ВидДокумента, Параметры));
	
	Возврат Результат;

КонецФункции

// Загружает список документов, полученных из УТМ.
//
// Параметры:
//  МассивДокументов  - Массив - полученные документы из ТМ ЕГАИС,
//  ДополнительныеПараметры - Произвольный - параметры прикладной конфигурации.
//
// Возвращаемое значение:
//   Соответствие  - загруженные документы.
//
Функция ОбработатьВходящиеДокументы(Знач МассивДокументов, Знач ДополнительныеПараметры) Экспорт
	
	Возврат ИнтеграцияЕГАИС.ОбработатьВходящиеДокументы(МассивДокументов, ДополнительныеПараметры);
	
КонецФункции

// Записывает данные запроса в регистр сведений ЗапросыЕГАИС.
//
// Параметры:
//  ИдентификаторЗапроса - Строка - идентификатор исходящего запроса,
//  ТипЗапроса           - СправочникСсылка.ВидыОбъектовЕГАИС - вид исходящего документа,
//  ДатаЗапроса          - Дата - дата запроса.
//
Процедура ЗаписатьДанныеЗапроса(ИдентификаторЗапроса, ТипЗапроса, ДатаЗапроса = Неопределено) Экспорт
	
	Запись = РегистрыСведений.ЗапросыЕГАИС.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = ИдентификаторЗапроса;
	Запись.ТипЗапроса    = ТипЗапроса;
	Запись.ДатаЗапроса   = ?(НЕ ЗначениеЗаполнено(ДатаЗапроса), ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату(), ДатаЗапроса);
	Запись.Записать();
	
КонецПроцедуры

// Проверяет наличие исходящего запроса по идентификатору.
//
// Параметры:
//  ИдентификаторЗапроса - Строка - идентификатор исходящего запроса.
//
// Возвращаемое значение:
//   Булево - признак наличия запроса.
//
Функция ЕстьИсходящийЗапрос(ИдентификаторЗапроса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторЗапроса", ИдентификаторЗапроса);
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТоварноТранспортнаяНакладнаяЕГАИС.Ссылка
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяЕГАИС КАК ТоварноТранспортнаяНакладнаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяЕГАИС.ИдентификаторИсходящегоЗапросаАктаПодтверждения = &ИдентификаторЗапроса";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

// Получает электронную подпись чека ККМ.
//
// Параметры:
//  ДанныеЧека     - Структура - данные чека,
//  ТаблицаТоваров - Массив    - состав чека.
//
// Возвращаемое значение:
//   Структура - значения подписи и URL, полученные из ТМ ЕГАИС.
//
Функция ПараметрыЗапросаЧекаККМ(Знач ДанныеЧека, Знач ТаблицаТоваров) Экспорт
	
	Результат = Новый Структура;
	
	ТекстОшибки = "";
	ТекстXML = ИнтеграцияЕГАИС.ТекстXMLВыгрузкиЧека(Справочники.ВидыОбъектовЕГАИС.ЧекККМ, ДанныеЧека, ТаблицаТоваров, ТекстОшибки);
	
	Результат.Вставить("Результат"     , ПустаяСтрока(ТекстОшибки));
	Результат.Вставить("ОписаниеОшибки", ТекстОшибки);
	Результат.Вставить("АдресЗапроса"  , Справочники.ВидыОбъектовЕГАИС.ЧекККМ.ПутьНаСервере);
	Результат.Вставить("ТекстXML"      , ТекстXML);
	
	Возврат Результат;
	
КонецФункции

// Проверят использование механизма регистрации розничных продаж в ЕГАИС.
//
// Параметры:
//  ДатаПродажи  - Дата - дата, на которую нужно проверить использование регистрации продаж.
//                        Если не указана, то проверяться будет текущая дата сеанса.
//
// Возвращаемое значение:
//   Булево   - признак использования регистрации продаж.
//
Функция ИспользуетсяРегистрацияРозничныхПродажВЕГАИС(Знач ДатаПродажи = Неопределено) Экспорт

	Если НЕ ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ВыгружатьЧекиЕГАИС") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаПродажи) Тогда
		ДатаПродажи = ОбщегоНазначенияКлиентСервер.ПолучитьТекущуюДату();
	КонецЕсли;
	
	ДатаНачалаРегистрации = ЗначениеНастроекПовтИсп.ПолучитьЗначениеКонстанты("ДатаНачалаВыгрузкиЧековЕГАИС");
	
	Возврат ДатаПродажи >= ДатаНачалаРегистрации И ЗначениеЗаполнено(ДатаНачалаРегистрации);

КонецФункции

Функция ВыгружатьПродажиНемаркируемойПродукцииВЕГАИС() Экспорт
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти
